---
kind: enumMember
id: F:Autodesk.Revit.DB.StructDeckEmbeddingType.Standalone
enum: Autodesk.Revit.DB.StructDeckEmbeddingType
source: html/2cc96ee3-bb7b-26e8-271c-25975dbc9fc4.htm
---
# Autodesk.Revit.DB.StructDeckEmbeddingType.Standalone

Standalone deck.